h = "Даша, привет!"
h_1 = "Как дела?"
# print(h)
# print(print)
# print(h_1)
c = 123
f = 123.5
b = False
bt = b'sadfasdfasdfas'
wrfqefqefqewqefqerfqerfqerfeqrferfqer = 1232
j = 1

# print(int, bool, float, str)
# a = int(100 / 2)
# p = bool()
# i = float()
# o = str()
# print(a, p, o)
# print(100 / 2)

# res = 100 / 3
# print(res)
# print(int(res))
# b = True
# print(int(b))
# print(float(b))

# b = False
# print(int(b))
# print(float(b))

# i = 0.01
# print(bool(i))

s = "test string"
s_1 = 'test string 2'
s3 = ''
s4 = '123.3'
# print(s, s_1, sep=', ', end='.\n')
# print(s + ', ' + s_1 + '.')
# print(bool(s3))
print(type(float(s4)), float(s4), type(s4), s4)

"""ДЗ:
Лутц: глава 1, 2, 3.
Важно внимательно прочитать стр 84, стр 86, стр 93, 99
Можно не читать стр 94-96

У тебя должен быть установлен интерпретатор, ты должна уметь писать текстовые файлы программ
и запускать их через интерпретатор из командной строки.

+ маленькие задачки:
Создать несколько переменных, вывести их на экран, вывести на экран их тип, попробовать привести
их к типу друг друга (использовать типы str, int, float, bool). Задокументировать те ошибки,
которые ты отловишь в рамках выполнения этого задания и объяснить пртичину их возникновения, а
также устранить их.
"""