"""
Классификация web frameworks
HTTP
HTML, парсинг HTML-файлов
XML
Сбор данных с помощью фреймворка Scrapy
Язык шаблонов Jinja2
Основы API
Стандарты API (REST, XML-RPC, Swagger, JSON API)
Архитектурный подход API First
Основы работы с Flask
"""
# Фреймворк - программное обеспечение, облегчающее разработку и объединение разных компонентов
# большого программного проекта. Отличие от библеотеки в том, что библиотека встраивается в наш код,
# а в случае с фремворком - наш код встраивается в него.

# Flask - фреймворк для создания веб-приложений на языке программирования Python.
# Flask покрывает минимальные требования. К примеру Django

# сначала создаём app.py