###################################################################################
########################### Система контроля версий GIT ###########################
###################################################################################
#  Зачем нужно - для эффективной разработки проекта внутри команды

# Репозиторий хранит в себе историю всех изменений по проекту

# git --version - проверяем, установлен ли git
# git и github - не одно и то же! git - это инструмент, а github - удалённый (от слова ДАЛЬ) репозиторий!

# чтобы начать работу над проектом, нужно для начала клонировать репозиторий:
# git clone <ссылка на репоиторий> - как правило эту ссылку можно найти на странице самого репозитория

###################################################################################
############################ Тестирование кода. Pytest ############################
###################################################################################

# для установки библиотеки pytest: pip install pytest

# требования для запуска тестов:
# 1. наличие папки tests в проекте
# 2. 